[{"dia_evento":"1","data":"11/11/2022\nsexta","horario":"18h","duracao":"30 minutos","tipo":"","titulo":"Abertura","proponente":"Comissão organizadora","proponente_url":"","descricao":"Abertura do evento e da galeria virtual onde falaremos sobre o que é um PCD, como nossa organização funciona e por que fazemos isso. Apresentaremos também a galeria, alguns diferenciais dessa edição, o que esperar do ano que vem e como você pode participar e colaborar com a organização.","minibio":"","requisitos":"","url_imagem":"","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=BYb83ir6Vz0&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=1","focus_mode":"sim","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"1","data":"11/11/2022\nsexta","horario":"19h","duracao":"2 horas","tipo":"Oficina","titulo":"Introdução à programação em Javascript","proponente":"Guilherme Ranoya","proponente_url":"https://twitter.com/ranoya ","descricao":"Oficina/Workshop para quem quer dar seus primeiros passos, entender os fundamentos básicos e os contextos/ambientes onde o código Javascript roda. Destinada a quem está migrando do Processing para o P5, para quem está iniciando com o P5, ou pra quem está querendo programar com Javascript puro.","minibio":"Professor e pesquisador do Programa de Pós-Graduação em Design (PPGDesign) da UFPE na linha de Design da Informação, e professor do Departamento de Design do Centro de Artes e Comunicação da mesma universidade. Líder do Grupo de Pesquisa Integrada em Design e Computação (D+C), colaborador do Grupo de Pesquisa em Design da Informação/UFPE, do Grupo de Pesquisa, Experimentação e Inovação em Arte, Tecnologia e Criatividade (Mustic), e coordenador do Laboratório de Visualização e Sentidos do Nordeste – VISSE.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-GuilhermeRanoya.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=IgcRLUcK-14&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=2","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"1","data":"11/11/2022\nsexta","horario":"21h","duracao":"1 hora","tipo":"Palestra","titulo":"Arte Generativa com Pen Plotters","proponente":"Marcelo Prates","proponente_url":"https://marceloprates.github.io/","descricao":"Pen plotters são ferramentas que consistem num braço mecânico capaz de desenhar numa superfície com caneta (ou lápis, giz, etc.) a partir de um arquivo vetorial (SVG). Nessa atividade explicaremos como é possível usar pen plotters para produzir trabalhos de arte generativa com foco em Python. Abordaremos bibliotecas e plugins voltados para auxiliar o artista nesse processo e também iremos expor trabalhos e trechos de código desenvolvidos pelo palestrante. Por fim, discutiremos os limites do uso criativo desse tipo de ferramenta, indo além da aplicação tradicional de desenho no papel com caneta (por exemplo, descreveremos como é possível fazer trabalhos de longa exposição com light painting usando pen plotters).","minibio":"Marcelo Prates é Bacharel e Doutor em Computação pela Universidade Federal do Rio Grande do Sul (UFRGS), onde atuou em linhas de pesquisa envolvendo otimização combinatória, computação social e humana e principalmente machine learning, com foco em viés de máquina (machine bias) e deep learning aplicado a redes (graph neural networks). Atua como cientista de dados e pesquisador de IA no setor privado desde 2019 e tem passagem pela Samsung Research Brazil, onde liderou o desenvolvimento de um app de monitoramento de saúde baseado em IA para o Samsung Galaxy Watch 4, e pela empresa americana conDati, onde atuou como Principal Data Scientist e no desenvolvimento de soluções de Machine Learning para marketing digital. Trabalha com arte generativa (isto é, arte feita com programação) como hobby desde 2015 e é o criador da ferramenta de confecção de mapas 'prettymaps'.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-MarceloPrates.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=JpdP-6kArWk&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=3","focus_mode":"sim","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"9h","duracao":"1 hora","tipo":"Perfomance","titulo":"O Labirinto de Processing","proponente":"Guilherme Silveira","proponente_url":"https://www.instagram.com/guilherme_pessoal/","descricao":"O Labirinto de Processing é uma performance participativa semeada por arte generativa que também funciona como workshop. Utilizando conceitos de arte generativa, o artista criou inúmeros labirintos que indicam caminhos entre a pessoa participante e sua próxima obra.\n\nNo início da performance, cada participante recebe o link de um labirinto único e cria um novo sketch no p5.js. Por exemplo, se temos 20 participantes, serão 20 labirintos e cada pessoa com seu próprio sketch (20 sketches).\n\nCada passo no labirinto é o nome de uma função ou constante de p5.js. A participante deve então adicionar aquela função no seu sketch de alguma forma e avançar um passo no labirinto.\n\nO labirinto é um grid 7x7 com mais de um caminho possível para a saída. Nem todas as participantes serão capazes de chegar ao fim do labirinto, mas não há regras apresentadas de como o labirinto deve ser caminhado: assim como no mundo real, cada participante encontrará seu caminho através da api (referência) do p5.js, enquanto explora algo novo.\n\nEnquanto participantes traçam seus próprios caminhos e criam seus sketches, digitam no chat cada palavra conquistada. O artista então é responsável por - em seu próprio sketch - utilizar tal palavra.\n\nTerminamos a performance participativa com N participantes, N+1 sketches nas mais diversas explorações de nossos próprios caminhos.\n\nOs últimos 5 minutos são usados para passar pelos sketches resultantes.\n\nO labirinto funciona ao mesmo tempo como abstração e materialização do processo de criação de sketches usando Processing.","minibio":"Guilherme trabalha na área de educação e tecnologia, sendo fundador da escola de programação Alura com mais de 400 mil alunes. Sua carreira artística é mais recente, iniciando em 2021, é o único brasileiro a ter participado do maior programa de mágica dos Estados Unidos, o Penn & Teller Fool US usando conceitos de mágica generativa. Publicou artigos científicos e possui patente envolvendo alta tecnologia e mágica como arte performática.\n\nSeu trabalho nas artes visuais fora do universo da mágica tem início em 2022, incluindo o aceite no mestrado de fine arts em Media Arts da UCLA com o fundador do processing, Casey Reas.\n\nSuas obras buscam \"a ampliação da contradição existente entre os sentimentos e as paixões, fazendo com que cambaleemos baquicamente de um lado para o outro\" (Hegel, 1835); levando ao raciocinar.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-GuilhermeSilveira.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=liCrpecRaek&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=4","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"10h","duracao":"2 horas","tipo":"Palestra","titulo":"Agentes Autônomos (e suas criações)","proponente":"Mateus Berruezo","proponente_url":"https://codigotranscendente.github.io/livro/","descricao":"Palestra com o objetivo de introduzir, superficialmente, o conceito de agentes autônomos (sistemas computacionais que tomam ações sem a interferência humana, de acordo com seus próprios objetivos e interações com o ambiente em que estão inseridos). A ideia também é mostrar como pequenas variações nos agentes geram visualizações e padrões amplamente distintos. ","minibio":"Engenheiro especializado na padronização e automatização de tarefas e processos. Autor do livro \"O Código Transcendente\" que introduz, de maneira prática, a programação e arte gerativa sob um foco visual. ","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-MateusBerruezo.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=2dYJqV2s19c&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=5","focus_mode":"sim","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"14h","duracao":"2 horas","tipo":"Oficina","titulo":"Geração de Imagens com IA: coletânea de ferramentas para experimentação","proponente":"Filipe Calegario","proponente_url":"https://github.com/filipecalegario/","descricao":"Esta oficina é um momento de experimentação com as ferramentas mais atuais de geração de imagens usando IA. É voltado para o público de artistas, designers, pessoas desenvolvedoras, entusiastas e curiosas.\n\nComeçaremos entendendo o funcionamento de alguns modelos existentes (ex: GAN, diffusion, latent diffusion), depois veremos exemplos de uso e de adaptações das ferramentas (ex: MidJourney, DALL-E 2, Stable Diffusion), além de combinações e usos criativos das técnicas associadas.\n\nConsiderando a geração de imagens baseada em textos, veremos técnicas de engenharia de prompt, ou seja, qual a melhor combinação de palavras para termos uma imagem desejada. Trabalharemos em grupos e individualmente na composição de prompts e experimentação na geração das imagens. O objetivo é termos uma galeria coletiva ao final do workshop.\n\nDepois desse momento mão-na-massa, abrimos para discutir qual o impacto que tais ferramentas podem ter no processo criativo humano e as repercussões éticas emergentes.\n\nUma pergunta que guiará o workshop é: como diminuir a distância entre tais ferramentas e os artistas, designers, pessoas desenvolvedoras, entusiastas e curiosas?","minibio":"Filipe Calegario é professor do Centro de Informática da Universidade Federal de Pernambuco (CIn-UFPE) com pesquisas em criatividade computacional, computação musical, prototipação eletrônica, fabricação digital e design de interação de novas interfaces para expressão musical. Possui doutorado em Ciência da Computação pelo CIn-UFPE. Em 2015, foi pesquisador visitante no Laboratório de Dispositivos de Entrada e Interação Musical da Universidade McGill, Canadá. É um dos fundadores da Batebit Artesania Digital e um dos coordenadores do MusTIC, grupo de pesquisa em arte, tecnologia e criatividade do CIn-UFPE. Participou e apresentou trabalhos em diversos eventos na interseção entre arte e tecnologia, como Recife: The Playable City, Festival Internacional de Linguagem Eletrônica (FILE), Festival de Arte Digital (FAD), Continuum, Interactivos. Filipe foi pesquisador industrial do Instituto SENAI de Inovação em Tecnologias da Informação e Comunicação, onde coordenou o projeto de inovação CIIMUS, Criatividade e Inovação para a Indústria da Música. Em 2014 e 2018, foi contemplado com o financiamento da Rumos Itaú Cultural para o desenvolvimento do aplicativo musical Tocada e o aprimoramento do kit de ferramentas para experimentação de instrumentos musicais digitais Probatio. Em 2019, publicou o livro intitulado “Desinging Digital Musical Instruments with Probatio: A Physical Prototyping Toolkit” (“Projetando Instrumentos Musicais Digitais Utilizando Probatio: Um Kit de Ferramentas de Prototipação Física”) que enfoca o processo de criação de instrumentos musicais digitais e propõe uma ferramenta de prototipagem ágil de tais artefatos, acelerando os ciclos de experimentação para alcançar mais resultados expressivos para e por artistas.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-FelipeCalegario.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=4nF_33VcQ-U&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=6","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"16h","duracao":"1 hora","tipo":"Oficina","titulo":"Vídeo Sintetizadores - criando imagens em processing","proponente":"Rodrigo Rezende","proponente_url":"","descricao":"Nesta palestra vou mostrar como estou compilando e desenvolvendo uma parte do meu mestrado onde através da manipulação de equações crio ou altero modos e mistura de imagens, estáticas ou em movimento no Processing.\n\nPretendo demostrar alguns dos principios de manipulação de imagens analógicas e digitais e também alguns experimentos que venho realizando, através do uso do Processing e algum material de apoio.","minibio":"Rodrigo Rezende é mestrando em Artes Visuais na Unesp. Atua como Artista no Coletivo RE(C)organize e desenvolve pesquisas com software e hardware livres. Atua como multiplicador de conhecimento, através de oficinas nas áreas de multimídia, arte computacional e audiovisual, além de desenvolver sistemas interativos em tempo real para as artes e também frequenta espaços Makers, colaborando e compartilhando seus conhecimentos em tecnologias.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-RodrigoRezende.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=6na4cgitU-0&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=7","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"2","data":"12/11/2022\nsábado","horario":"17h","duracao":"1 hora","tipo":"Conversa","titulo":"Conversas sobre Dall-e 2, Midjourney e Stable Diffusion: Impactos na Arte","proponente":"<strong>Participantes:</strong> Alexandre Rangel, Guilherme Silveira, Leo Sampaio e Vanessa Rosa. <strong>Mediação:</strong> Sergio Venancio","proponente_url":"","descricao":"Dall-E 2, Midjourney e Stable Diffusion são modelos de inteligência artificial que geram imagens impressionantes a partir de comandos de texto, e se tornaram acessíveis a grandes públicos. Quais são os impactos dessas tecnologias sobre processos criativos? Quais suas vantagens e desvantagens, possibilidades e limitações? Como muda o trabalho do artista que utiliza essas tecnologias? Ou não muda? Trazemos para esta roda de conversa os artistas Vanessa Rosa e Alexandre Rangel, a cientista Leo Sampaio e o empresário e educador Guilherme Silveira, que vêm utilizando e experimentando com esses modelos, e contarão sobre suas experiências e opiniões.","minibio":"","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-SergioVenancio.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=huq8TdHK5Dw&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=8","focus_mode":"sim","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"9h","duracao":"1 hora","tipo":"Oficina","titulo":"Criando com paletas de cores em p5.js","proponente":"Gustavo Mandolesi","proponente_url":"","descricao":"Apresentação de uma biblioteca de código aberto para facilitar o gerenciamento e o uso de palhetas de cores em p5.js. Um pouco de teoria sobre a aplicação de cores em programação criativa e demonstrações práticas através de exemplos.","minibio":"Desenvolvedor de software","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-GustavoMandolesi.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=O7Aq1NbZPm0&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=9","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"10h","duracao":"2 horas","tipo":"Oficina","titulo":"Primeiros passos na programação criativa com Python","proponente":"Alexandre Villares","proponente_url":"https://twitter.com/villares","descricao":"Uma atividade introdutória para quem quer experimentar pela primeria vez gerar imagens com programação, usando Python.","minibio":"Professor, artista visual e consultor em projetos de design e novas mídias. Pesquisa práticas artísticas que se valem de meios computacionais e o ensino de programação em contextos visuais. Graduado em arquitetura e urbanismo pela FAU-USP (2000) e mestre pela FEC-Unicamp (2019). Co-organizador da Noite de Processing em São Paulo. Ministra cursos na graduação e na pós-graduação de diversas instituições, desenvolve cursos e oficinas independentes ou como educador de tecnologias e artes no Sesc-SP.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-AlexandreVillares.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=1JOigKDODsg&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=10","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"14h","duracao":"2 horas","tipo":"Oficina","titulo":"Joguinho Arcade do Zero!","proponente":"John (Introscopia)","proponente_url":"https://introscopia.github.io/","descricao":"Vamos retomar a tradição dos primeiros PCDs e tentar montar um joguinho (ou protótipo de jogo, ou esboço...) em apenas duas horas! Tragas os seus melhores truques e gambiarras, ou, se ainda não programa muito, traga ideias, desenhos, música, ou só entusiasmo já ta ótimo também!","minibio":"John (Introscopia) é um 'programador criativo' e professor de programação interessado no domínio do computador como ferramenta de expressão, especialmente através de experiências interativas e colaborativas.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-Introscopia.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=a9RWSq-Bx4A&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=11","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"3","data":"13/11/2022\ndomingo","horario":"16h","duracao":"1 hora","tipo":"Palestra","titulo":"Processing + Dados : entre a arte e o design","proponente":"Barbara Castro","proponente_url":"https://www.instagram.com/barbaracastro/","descricao":"Barbara Castro irá falar sobre os diferentes projetos que já realizou enquanto artista e designer usando dados com Processing. A palestra irá abordar tanto aspectos técnicos, demonstração de código, quanto questões sobre o processo de criação e experimentação envolvidos na programação criativa.","minibio":"Barbara Castro é artista, designer e pesquisadora. Doutora em Artes Visuais pela EBA/UFRJ, Barbara é professora de Design da PUC-Rio. Sua pesquisa teórico-prática em visualização artística de dados e arte computacional aborda o instinto de sobrevivência, a vitalidade e o Antropoceno. Como diretora de criação do estúdio Ambos&& já realizou curadoria de exposições e instalações interativas para instituições como Museu do Amanhã, CCBB, Museu Nacional, entre outros. Destacam-se a co-idealização da exposição e do livro Existência Numérica no Oi Futuro e a co-curadoria da exposição Data Corpus da Casa Firjan.","requisitos":"","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-BarbaraCastro-Palestra.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/82893326638?pwd=clNrRENEWE5TS0QvUHVvcFBEdFBEUT09","url_youtube":"https://www.youtube.com/watch?v=wfrmim_rUPQ&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=12","focus_mode":"sim","evento_ativo":"não","inscricao_aberta":"não"},{"dia_evento":"4","data":"12/11 e 13/11","horario":"19h","duracao":"2 encontros de 3 horas","tipo":"Oficina","titulo":"Uma introdução à programação criativa com uma introdução à caligrafia e vice-versa","proponente":"Mariana Leal","proponente_url":"https://www.instagram.com/amaolevissima/","descricao":"Esta proposta visa oferecer uma oficina de introdução à programação criativa por meio de uma introdução à caligrafia e vice-versa. Aprenderemos a programar programando a nossa primeira pena de ponta reta. Além disso, aprenderemos como inserir pautas dentro do nosso sketch para que possamos praticar caligrafia dentro do processing, sem sair do computador. \n\nA oficina precisará de dois dias para acontecer satisfatoriamente. Um dia para programação, outro dia para prática caligráfica. Ensinarei o alfabeto fundamental letra por letra, e depois haverá tempo para muita prática e esclarecimento de dúvidas.","minibio":"Mariana Leal is a calligrapher and creative coder based in São Paulo, Brazil. In 2015, during the gestural warm ups for her work in calligraphy for invitations, she fell in love with the mobility of the body that calligraphy demands. In 2019, she discovered that programming affords new types of calligraphic brushes. Brushes that take the data of the mobility of the arms to new levels of expressivity. Currently she investigates the expressive capacities of her hybrid calligraphy, half code, half human gesture.","requisitos":"No segundo dia será necessário ter em mãos algum tipo de mesa de digitalização (Wacom, Cintiq, Multilaser etc.)","url_imagem":"https://pcd2022.encontrosdigitais.com.br/images/Atividade-MarianaLeal.jpg","url_inscricao":"https://docs.google.com/forms/d/e/1FAIpQLSePr-PMl7L-ijajbkwXa5ROOnhVZ-EBUvD_FMEix5uoCXcEbQ/viewform?usp=sf_link","url_calendario":"","url_video_conferencia":"https://us06web.zoom.us/j/81446351644?pwd=ZkI5YTNDazIrQzBmUTZoRTN5T1dMdz09","url_youtube":"https://www.youtube.com/watch?v=39xKFGmHao0&list=PLCSyFEVJoho6xaic1oBtiwf8xZCAezIp1&index=13","focus_mode":"não","evento_ativo":"não","inscricao_aberta":"não"}]